# Introduction to Pandas

It is the go-to library for handling tabular data in Python.

In [3]:
import pandas as pd

## Creating a Dataframe
A dataframe is a kind of table with rows and columns. Though they do have some unique properties.

In [4]:
dataTable = {
    'Name': ['Prashant','Rahul','Wangsham'],
    'Age' : [21, 22, 20],
    'Place' : ['Dehradun','Delhi','Nagaland']
}

df= pd.DataFrame(dataTable)
print(df)

       Name  Age     Place
0  Prashant   21  Dehradun
1     Rahul   22     Delhi
2  Wangsham   20  Nagaland

## Load a CSV File
A CSV file (Comma Separated Values) is a simple structured format used to store tabular data. But here we use a plain text file for it only and separate the values with commas so as to make separations.

In [9]:
df= pd.read_csv("sample_csv_file.csv")
df.head()

              Name  Age      Place   Score
0   Prashant Yadav   21   Dehradun  100.00
1     Rahul Pathak   22      Delhi   98.56
2  Wangsham Younpe   20   Nagaland   85.88

## Common Dataframe Functions
The Notebook only shows output for the last line here. So running all at once is not possible. We can use print() if we want all results at once. 
Here, remove '#' to run these below one-by-one.

In [ ]:
#df.shape
#df.columns          #column names
#df.info()
#df.describe()       #stats summary for numeric columns
#df['Place']         #access column
#df[['Name','Score']] #access multiple columns 
#df.iloc[0]          #select complete first row
#df.loc[0,'Name']    #select specific cell

### Filter rows

In [28]:
print(df['Age']<=21)          #print() used. Both expressions will be shown.

df[df['Age']<=21]

0     True
1    False
2     True
Name: Age, dtype: bool

              Name  Age      Place   Score
0   Prashant Yadav   21   Dehradun  100.00
2  Wangsham Younpe   20   Nagaland   85.88

### Add new column

In [21]:
df["Degree at age"]= df["Age"]+3
df.head()

              Name  Age      Place   Score  Degree at age
0   Prashant Yadav   21   Dehradun  100.00             24
1     Rahul Pathak   22      Delhi   98.56             25
2  Wangsham Younpe   20   Nagaland   85.88             23
3          Shaurya   21      Noida   97.00             24

### Add new row

In [23]:
df.loc[len(df)]= ["Shaurya",21,"Noida", 50, 22]
print(df)

              Name  Age      Place   Score  Degree at age
0   Prashant Yadav   21   Dehradun  100.00             24
1     Rahul Pathak   22      Delhi   98.56             25
2  Wangsham Younpe   20   Nagaland   85.88             23
3          Shaurya   21      Noida   97.00             24
4          Shaurya   21      Noida   97.00             22
5          Shaurya   21      Noida   50.00             22

### Delete Column

In [13]:
df.drop("Degree at age", axis=1, inplace=True)

In [14]:
df.head()

              Name  Age      Place   Score
0   Prashant Yadav   21   Dehradun  100.00
1     Rahul Pathak   22      Delhi   98.56
2  Wangsham Younpe   20   Nagaland   85.88
3          Shaurya   21      Noida   97.00

## Handle Missing Data

In [16]:
df.isnull().sum()           #count missing data
df.fillna(0,inplace= True)  #fill missing with 0
df.dropna(inplace= True)    #drop rows with missing data

print(df)

              Name  Age      Place   Score
0   Prashant Yadav   21   Dehradun  100.00
1     Rahul Pathak   22      Delhi   98.56
2  Wangsham Younpe   20   Nagaland   85.88
3          Shaurya   21      Noida   97.00

## Grouping and Aggregation in Pandas

### Mean

In [24]:
avg_scores= df.groupby("Place")["Score"].mean()
print(avg_scores)

Place
 Nagaland     85.880000
Dehradun     100.000000
Delhi         98.560000
Noida         81.333333
Name: Score, dtype: float64


### Mean, max and min

In [27]:
# when you want want both MEAN and MAX score per city

summary= df.groupby("Age")["Score"].agg(['mean','max','min'])
print(summary)

      mean     max    min
Age
20   85.88   85.88  85.88
21   86.00  100.00  50.00
22   98.56   98.56  98.56

### Group by multiple columns

In [28]:
groupedM= df.groupby(["Place","Age"])["Score"].mean()
print(groupedM)

Place      Age
 Nagaland  20      85.880000
Dehradun   21     100.000000
Delhi      22      98.560000
Noida      21      81.333333
Name: Score, dtype: float64

In [29]:
print(df)

              Name  Age      Place   Score  Degree at age
0   Prashant Yadav   21   Dehradun  100.00             24
1     Rahul Pathak   22      Delhi   98.56             25
2  Wangsham Younpe   20   Nagaland   85.88             23
3          Shaurya   21      Noida   97.00             24
4          Shaurya   21      Noida   97.00             22
5          Shaurya   21      Noida   50.00             22

## Save or export file

In [32]:
df.to_csv("cleaned_data.csv", index= False)
df.to_excel("cleaned_data_excel.xlsx", index= False)